from random import randint, choice
import datetime

def ticket(user, args):
    if len(args) != 4 and not "random" in args:
        return "Ты неправильно указал аргументы!\n\nЕсли хочешь сгенерировать случайный билет, то введи команду: /ticket random\n\nИли же ты можешь указать аргументы: /ticket компания маршрут номер_автобуса номер_билета. Вместо компания укажи либо wl для 'Вест лайн', либо kgt для 'Калининград-ГорТранс', либо любое своё название. Маршрут, номер автобуса и номер билета будут отображатся так же, как ты их введёшь"

    if "random" in args:
        company = choice(['ООО "Вест Лайн"', 'АО "Калининград-ГорТранс"'])
        track = f"{randint(1, 99)}"
        id = f"{chr(randint(1072, 1103))}{chr(randint(1072, 1103))}{randint(100, 999)}39"
        number = f"1 {randint(100, 999)} {randint(100, 999)} {randint(100, 999)}"
    else:
        if "wl" == args[0]:
            company = 'ООО "Вест Лайн"'
        elif "kgt" == args[0]:
            company = 'АО "Калининград-ГорТранс"'
        else:
            company = args[0]
        track = args[1]
        id = args[2]
        number = " ".join(args[3:])

    text = f'''Билет куплен успешно.
{company}
🚏 {track}
🚌 {id}
🪙 Тариф: Полный 38,00 ₽
🎫 Билет № {number}
🕑 Действует до {(datetime.datetime.now() + datetime.timedelta(minutes=50, hours=2)).strftime("%H:%M")}'''

    return text